* PunchCard:
  :LOGBOOK:
  CLOCK: [2019-06-06 Thu 08:29]--[2019-06-06 Thu 08:54] =>  0:25
  :END:

** Tasks 
*** Flask Goals:  
**** TODO Reconfigure python project.
     :LOGBOOK:
     CLOCK: [2019-06-06 Thu 10:08]--[2019-06-06 Thu 10:33] =>  0:25
     CLOCK: [2019-06-06 Thu 09:14]--[2019-06-06 Thu 09:39] =>  0:25
     :END:
**** TODO Send processed excel file instead of duplicate.
**** TODO Enable route to accept multiple numeric arguments.
**** TODO Set up separate app that accepts multiple string arguments and responds with a zip file.
**** TODO Convert xls files to xlsx files.  
**** TODO Delete uploaded pre-processed fiels.
**** TODO Explore caching options for repeated requests.
*** React Goals:
**** TODO Set up Request for sending multiple numeric arguments alongside filename parameter.
**** TODO Do the same for zip file route.
**** TODO Conditionally render zip file and download links based on File Array length. 
**** TODO Styles.
*** Pandas Goals:
**** TODO Clean up class.
**** TODO Enable class to run multiple time deltas on same dataframe without rereading xlsx file.


    
